[
  {
    "id":"AIPlayMaker",
    "title": "AIPlayMaker",
    "description": "AIPlayMaker is a dynamic AI agent for board games, leveraging advanced algorithms like Minimax and Monte Carlo Tree Search (MCTS) to deliver challenging gameplay. Currently, the service features a machine learning model for Tic Tac Toe and is set to expand with Reinforcement Learning models, aiming to compete with MCTS. AIPlayMaker offers a user-friendly RESTful API and is under active development to further improve its AI capabilities and support a wider range of games.",
    "image_url": "aiplaymaker.webp",
    "tech_stack": ["Python", "Flask", "Poetry"],
    "link": "https://github.com/Nootonium/AIPlaymaker",
    "github": "https://github.com/Nootonium/AIPlaymaker"
  },
  {
    "id":"CADE",
    "title": "C.A.D.E. - Comprehensive Automated Digital E-butler",
    "description": "CADE is a comprehensive backend service designed to the recording, processing, and automated management of messages from contact forms, including an automated response generated by GPT and the sending back of an email response. The application employs Node.js, Express, and MongoDB to receive and store messages securely. It follows industry-standard production-level practices, including comprehensive testing with Jest, error handling, logging with Winston, and Continuous Integration via GitHub Actions.",
    "image_url": "cade.png",
    "tech_stack": ["Node", "Express", "MongoDB", "Jest", "Winston", "GitHub Actions", "TypeScript"],
    "link": "https://github.com/Nootonium/CADEMK0",
    "github": "https://github.com/Nootonium/CADEMK0"
  },
  {
    "id":"Nootfolio",
    "title": "Nootfolio",
    "description": "Welcome to my meticulously crafted web portfolio. I've focused on balancing high interactivity with optimal loading time, providing a seamless, engaging user experience without compromise on performance. Dive into the different sections where I showcase my skills and projects, and feel free to connect with me through the dedicated contact form. This portfolio reflects my dedication to blending functionality with aesthetics in web development, a characteristic I bring to all my projects.",
    "tech_stack": ["React", "TypeScript", "TailwindCSS", "Vite", "DaisyUI"],
    "link": "/",
    "github": "https://github.com/Nootonium/NootFolio"
  }
]
